---
kind: property
id: P:Autodesk.Revit.DB.DimensionSegment.Origin
zh: 原点
source: html/7d4b042c-21ed-610d-31b2-7b7f413c00c8.htm
---
# Autodesk.Revit.DB.DimensionSegment.Origin Property

**中文**: 原点

The segment origin.

## Syntax (C#)
```csharp
public XYZ Origin { get; }
```

## Remarks
The origin will be the midpoint of the line that
makes up the segment.